Repository: smellman/pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Options.po
Languages: ro_ro

source: Cluster Options
ro_ro: Opţiunile Clusterului

source: <indexterm significance="preferred"><primary>Special Cluster Options</primary></indexterm> <indexterm significance="preferred"><primary>Cluster Options</primary><secondary>Special Options</secondary></indexterm> Special Options
ro_ro: <indexterm significance="preferred"><primary>Opțiunile Speciale ale Clusterului</primary></indexterm> <indexterm significance="preferred"><primary>Opțiunile Clusterului</primary><secondary>Opțiuni Speciale</secondary></indexterm> Opțiuni Speciale

source: The reason for these fields to be placed at the top level instead of with the rest of cluster options is simply a matter of parsing. These options are used by the configuration database which is, by design, mostly ignorant of the content it holds. So the decision was made to place them in an easy to find location.
ro_ro: Motivul pentru care aceste câmpuri să fie plasate la nivelul cel mai înalt în loc să fie cu restul opţiunilor clusterului este pur şi simplu legat de parsare. Aceste opţiuni sunt folosite de către baza de date cu configuraţii care este, prin design, în principal ignorantă faţă de conţinutul pe care îl deţine. Aşa că decizia a fost luată de a le plasa într-o locaţie uşor de găsit.

source: <indexterm significance="preferred"><primary>Configuration Version, Cluster Option</primary></indexterm> <indexterm significance="preferred"><primary>Cluster Options</primary><secondary>Configuration Version</secondary></indexterm> Configuration Version
ro_ro: <indexterm significance="preferred"><primary>Versiunea Configurației, Opțiunea Clusterului</primary></indexterm> <indexterm significance="preferred"><primary>Opțiunile Clusterului</primary><secondary>Versiunea Configurației</secondary></indexterm> Versiunea Configurației

source: When a node joins the cluster, the cluster will perform a check to see who has the best configuration based on the fields below. It then asks the node with the highest (<varname>admin_epoch</varname>, <varname>epoch</varname>, <varname>num_updates</varname>) tuple to replace the configuration on all the nodes - which makes setting them, and setting them correctly, very important.
ro_ro: Când un nod aderă la cluster, clusterul va efectua o verificare pentru a vedea cine are cea mai bună configuraţie bazată pe câmpurile de mai jos. Apoi întreabă nodul cu cea mai mare tuplă (<varname>admin_epoch, epoch, num_updates</varname>) să înlocuiască configuraţia pe toate nodurile - fapt care face setarea acestora şi setarea lor corectă, foarte importantă.

source: Configuration Version Properties
ro_ro: Proprietăţi ale Versiunii Configuraţiei

source: Field
ro_ro: Câmp

source: Description
ro_ro: Descriere

source: <indexterm significance="preferred"><primary>admin_epoch Cluster Option</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>admin_epoch</secondary></indexterm> admin_epoch
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului admin_epoch</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>admin_epoch</secondary></indexterm> admin_epoch

source: Never modified by the cluster. Use this to make the configurations on any inactive nodes obsolete.
ro_ro: Niciodată modificat de către cluster. Folosiţi acesta pentru a face configuraţiile pe nodurile inactive să fie învechite.

source: <emphasis>Never set this value to zero</emphasis>, in such cases the cluster cannot tell the difference between your configuration and the "empty" one used when nothing is found on disk.
ro_ro: <emphasis>Nu setaţi niciodată această valoare la zero</emphasis>, în astfel de cazuri clusterul nu poate face diferenţa între configuraţia voastră şi cea "goală" folosită atunci când nu este găsit nimic pe disc.

source: <indexterm significance="preferred"><primary>epoch Cluster Option</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>epoch</secondary></indexterm> epoch
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului epoch</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>epoch</secondary></indexterm> epoch

source: Incremented every time the configuration is updated (usually by the admin)
ro_ro: Incrementată de fiecare dată când configuraţia este actualizată (de obicei de către administrator)

source: <indexterm significance="preferred"><primary>num_updates Cluster Option</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>num_updates</secondary></indexterm> num_updates
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului num_updates</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>num_updates</secondary></indexterm> num_updates

source: Incremented every time the configuration or status is updated (usually by the cluster)
ro_ro: Incrementată de fiecare dată când configuraţia sau statusul este actualizat (de obicei de către cluster)

source: Other Fields
ro_ro: Alte Câmpuri

source: Properties Controlling Validation
ro_ro: Proprietăţi care Controlează Validarea

source: <indexterm significance="preferred"><primary>validate-with Cluster Option</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>validate-with</secondary></indexterm> validate-with
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului validate-with</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>validate-with</secondary></indexterm> validate-with

source: Determines the type of validation being done on the configuration. If set to "none", the cluster will not verify that updates conform to the DTD (nor reject ones that don't). This option can be useful when operating a mixed version cluster during an upgrade.
ro_ro: Determină tipul de validare care este realizat pe configuraţie. Dacă este setat pe "none", clusterul nu va verifica dacă actualizările sunt conforme cu DTD (nici nu le va respinge pe cele care nu sunt). Această opţiune poate fi utilă când lucraţi cu o versiune combinată a clusterului în timpul unei actualizări.

source: Fields Maintained by the Cluster
ro_ro: Câmpuri Menţinute de către Cluster

source: Properties Maintained by the Cluster
ro_ro: Proprietăţi Menţinute de către Cluster

source: <indexterm significance="preferred"><primary>crm-debug-origin Cluster Fields</primary></indexterm> <indexterm><primary>Cluster Fields</primary><secondary>crm-debug-origin</secondary></indexterm> crm-debug-origin
ro_ro: <indexterm significance="preferred"><primary>Câmpurile Clusterului crm-debug-origin</primary></indexterm> <indexterm><primary>Câmpurile Clusterului</primary><secondary>crm-debug-origin</secondary></indexterm> crm-debug-origin

source: Indicates where the last update came from. Informational purposes only.
ro_ro: Indică de unde a provenit ultima actualizare. Numai cu scop informaţional.

source: <indexterm significance="preferred"><primary>cib-last-written Cluster Fields</primary></indexterm> <indexterm><primary>Cluster Fields</primary><secondary>cib-last-written</secondary></indexterm> cib-last-written
ro_ro: <indexterm significance="preferred"><primary>Câmpurile Clusterului cib-last-written</primary></indexterm> <indexterm><primary>Câmpurile Clusterului</primary><secondary>cib-last-written</secondary></indexterm> cib-last-written

source: Indicates when the configuration was last written to disk. Informational purposes only.
ro_ro: Indică momentul când configuraţia a fost scrisă ultima oară pe disc. Numai cu scop informaţional.

source: <indexterm significance="preferred"><primary>dc-uuid Cluster Fields</primary></indexterm> <indexterm><primary>Cluster Fields</primary><secondary>dc-uuid</secondary></indexterm> dc-uuid
ro_ro: <indexterm significance="preferred"><primary>Câmpurile Clusterului dc-uuid</primary></indexterm> <indexterm><primary>Câmpurile Clusterului</primary><secondary>dc-uuid</secondary></indexterm> dc-uuid

source: Indicates which cluster node is the current leader. Used by the cluster when placing resources and determining the order of some events.
ro_ro: Arată care dintre nodurile clusterului este conducătorul curent. Folosit de către cluster când plasează resurse şi determină ordinea anumitor evenimente.

source: <indexterm significance="preferred"><primary>have-quorum Cluster Fields</primary></indexterm> <indexterm><primary>Cluster Fields</primary><secondary>have-quorum</secondary></indexterm> have-quorum
ro_ro: <indexterm significance="preferred"><primary>Câmpurile Clusterului have-quorum</primary></indexterm> <indexterm><primary>Câmpurile Clusterului</primary><secondary>have-quorum</secondary></indexterm> have-quorum

source: Indicates if the cluster has quorum. If false, this may mean that the cluster cannot start resources or fence other nodes. See <literal>no-quorum-policy</literal> below.
ro_ro: Indică dacă clusterul are quorum. Dacă este fals, acest lucru ar putea însemna că, clusterul nu poate porni resurse sau evacua forțat alte noduri. Vedeţi <literal>no-quorum-policy</literal> mai jos.

source: Note that although these fields can be written to by the admin, in most cases the cluster will overwrite any values specified by the admin with the "correct" ones. To change the <varname>admin_epoch</varname>, for example, one would use:
ro_ro: Luaţi aminte că deşi aceste câmpuri pot fi scrise de către administrator, în majoritatea cazurilor clusterul va suprascrie orice valoare specificată de către administrator cu cele "corecte". Pentru a schimba <varname>admin_epoch</varname> de exemplu, cineva ar putea folosi:

source: A complete set of fields will look something like this:
ro_ro: Un set complet de câmpuri ar arăta ceva de genul acesta:

source: An example of the fields set for a cib object
ro_ro: Un exemplu al câmpurilor setate pentru un obiect CIB

source: Cluster options, as you might expect, control how the cluster behaves when confronted with certain situations.
ro_ro: Opţiunile clusterului, aşa cum v-aţi aştepta, controlează cum se comportă clusterul când se confruntă cu anumite situaţii.

source: They are grouped into sets and, in advanced configurations, there may be more than one<footnote> <para>This will be described later in the section on <xref linkend="ch-rules" /> where we will show how to have the cluster use different sets of options during working hours (when downtime is usually to be avoided at all costs) than it does during the weekends (when resources can be moved to the their preferred hosts without bothering end users)</para> </footnote>. For now we will describe the simple case where each option is present at most once.
ro_ro: Sunt grupate în seturi şi, în configuraţii avansate, ar putea fi mai mult de una<footnote> <para>Acest aspect va fi descris mai târziu în secţiunea despre <xref linkend="ch-rules" /> unde vă vom arăta cum să punem clusterul să folosească diferite seturi de opţiuni în timpul orelor de lucru (când nefuncţionarea este de evitat cu orice preţ) faţă de cele folosite în timpul weekend-urilor (când resursele pot fi mutate pe gazdele preferate fără să deranjeze utilizatorii finali)</para> </footnote>. Momentan vom descrie cazul simplu în care fiecare opţiune este prezentă cel mult o dată.

source: Available Cluster Options
ro_ro: Opţiuni Disponibile ale Clusterului

source: Option
ro_ro: Opţiune

source: Default
ro_ro: Valoare implicită

source: <indexterm significance="preferred"><primary>batch-limit Cluster Options</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>batch-limit</secondary></indexterm> batch-limit
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului batch-limit</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>batch-limit</secondary></indexterm> batch-limit

source: The number of jobs that the TE is allowed to execute in parallel. The "correct" value will depend on the speed and load of your network and cluster nodes.
ro_ro: Numărul de sarcini pe care TE-ul este permis să le execute în paralel. Valoarea "corectă" va depinde de viteza şi de încărcarea reţelei şi a nodurilor voastre din cluster.

source: <indexterm significance="preferred"><primary>no-quorum-policy Cluster Options</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>no-quorum-policy</secondary></indexterm> no-quorum-policy
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului no-quorum-policy</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>no-quorum-policy</secondary></indexterm> no-quorum-policy

source: What to do when the cluster does not have quorum. Allowed values:
ro_ro: Ce este de făcut atunci când clusterul nu are quorum. Valori permise:

source: ignore - continue all resource management
ro_ro: ignore - continuă toată gestionarea resurselor

source: freeze - continue resource management, but don't recover resources from nodes not in the affected partition
ro_ro: freeze - continuă gestionarea resurselor, dar nu recupera resurse de pe noduri care nu sunt în partiţia afectată

source: stop - stop all resources in the affected cluster partition
ro_ro: stop - opreşte toate resursele în partiţia de cluster afectată

source: suicide - fence all nodes in the affected cluster partition
ro_ro: suicide - evacuează forțat toate nodurile din partiţia de cluster afectată

source: <indexterm significance="preferred"><primary>symmetric-cluster Cluster Options</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>symmetric-cluster</secondary></indexterm> symmetric-cluster
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului symmetric-cluster</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>symmetric-cluster</secondary></indexterm> symmetric-cluster

source: Can all resources run on any node by default?
ro_ro: Pot rula toate resursele pe orice nod în mod implicit?

source: <indexterm significance="preferred"><primary>stonith-enabled Cluster Options</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>stonith-enabled</secondary></indexterm> stonith-enabled
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului stonith-enabled</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>stonith-enabled</secondary></indexterm> stonith-enabled

source: Should failed nodes and nodes with resources that can't be stopped be shot? If you value your data, set up a STONITH device and enable this.
ro_ro: Ar trebui nodurile care au eşuat şi nodurile cu resurse care nu pot fi oprite să fie împuşcate? Dacă ţineţi la datele voastre, setaţi un dispozitiv STONITH şi activaţi această opţiune.

source: If true, or unset, the cluster will refuse to start resources unless one or more STONITH resources have been configured also.
ro_ro: Dacă este true, sau nu este setată, clusterul va refuza să pornească resurse decât dacă unul sau mai multe dispozitive STONITH au fost configurate de asemenea.

source: <indexterm significance="preferred"><primary>stonith-action Cluster Options</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>stonith-action</secondary></indexterm> stonith-action
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului stonith-action</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>stonith-action</secondary></indexterm> stonith-action

source: Action to send to STONITH device. Allowed values: reboot, poweroff.
ro_ro: Acţiunea care să fie trimisă către dispozitivul STONITH. Valori permise: reboot, poweroff.

source: <indexterm significance="preferred"><primary>cluster-delay Cluster Options</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>cluster-delay</secondary></indexterm> cluster-delay
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului cluster-delay</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>cluster-delay</secondary></indexterm> cluster-delay

source: Round trip delay over the network (excluding action execution). The "correct" value will depend on the speed and load of your network and cluster nodes.
ro_ro: Întârzierea dus-întors experimentată pe reţea (excluzând timpul necesar executării acţiunii). Valoarea "corectă" va depinde de viteza şi de nivelul de încărcare al reţelei şi al nodurilor voastre din cluster.

source: <indexterm significance="preferred"><primary>stop-orphan-resources Cluster Options</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>stop-orphan-resources</secondary></indexterm> stop-orphan-resources
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului stop-orphan-resources</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>stop-orphan-resources</secondary></indexterm> stop-orphan-resources

source: Should deleted resources be stopped?
ro_ro: Ar trebui să fie oprite resursele şterse?

source: <indexterm significance="preferred"><primary>stop-orphan-actions Cluster Options</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>stop-orphan-actions</secondary></indexterm> stop-orphan-actions
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului stop-orphan-actions</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>stop-orphan-actions</secondary></indexterm> stop-orphan-actions

source: Should deleted actions be cancelled?
ro_ro: Ar trebui anulate acţiunile şterse?

source: <indexterm significance="preferred"><primary>start-failure-is-fatal Cluster Options</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>start-failure-is-fatal</secondary></indexterm> start-failure-is-fatal
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului start-failure-is-fatal</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>start-failure-is-fatal</secondary></indexterm> start-failure-is-fatal

source: When set to FALSE, the cluster will instead use the resource's <literal>failcount</literal> and value for <literal>resource-failure-stickiness</literal>.
ro_ro: Când este setat pe FALSE, clusterul va folosi în schimb <literal>failcount</literal>-ul şi valoarea resursei pentru <literal>resource-failure-stickiness</literal>.

source: <indexterm significance="preferred"><primary>pe-error-series-max Cluster Options</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>pe-error-series-max</secondary></indexterm> pe-error-series-max
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului pe-error-series-max</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>pe-error-series-max</secondary></indexterm> pe-error-series-max

source: The number of PE inputs resulting in ERRORs to save. Used when reporting problems.
ro_ro: Numărul de intrări PE care rezultă în ERROR(i) de a salva. Folosite când se raporteazâ probleme.

source: <indexterm significance="preferred"><primary>pe-warn-series-max Cluster Options</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>pe-warn-series-max</secondary></indexterm> pe-warn-series-max
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului pe-warn-series-max</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>pe-warn-series-max</secondary></indexterm> pe-warn-series-max

source: The number of PE inputs resulting in WARNINGs to save. Used when reporting problems.
ro_ro: Numărul de intrări PE care rezultă în WARNING-uri de a salva. Folosite când se raportează probleme.

source: <indexterm significance="preferred"><primary>pe-input-series-max Cluster Options</primary></indexterm> <indexterm><primary>Cluster Options</primary><secondary>pe-input-series-max</secondary></indexterm> pe-input-series-max
ro_ro: <indexterm significance="preferred"><primary>Opțiunea Clusterului pe-input-series-max</primary></indexterm> <indexterm><primary>Opțiunile Clusterului</primary><secondary>pe-input-series-max</secondary></indexterm> pe-input-series-max

source: The number of "normal" PE inputs to save. Used when reporting problems.
ro_ro: Numărul de intrări PE "normale" care să fie salvate. Folosite când se raportează probleme.

source: You can always obtain an up-to-date list of cluster options, including their default values, by running the <command>pengine metadata</command> command.
ro_ro: Puteţi întotdeauna să obţineţi o listă actualizată a opţiunilor clusterului, incluzând valorile implicite ale acestora, prin rularea comenzii <command>pengine metadata</command>.

source: <indexterm significance="preferred"><primary>Querying Cluster Options</primary></indexterm> <indexterm significance="preferred"><primary>Setting Cluster Options</primary></indexterm> <indexterm significance="preferred"><primary>Cluster Options</primary><secondary>Querying</secondary></indexterm> <indexterm significance="preferred"><primary>Cluster Options</primary><secondary>Setting</secondary></indexterm> Querying and Setting Cluster Options
ro_ro: <indexterm significance="preferred"><primary>Interogarea Opțiunilor Clusterului</primary></indexterm> <indexterm significance="preferred"><primary>Setarea Opțiunilor Clusterului</primary></indexterm> <indexterm significance="preferred"><primary>Opțiunile Clusterului</primary><secondary>Interogarea</secondary></indexterm> <indexterm significance="preferred"><primary>Opțiunilor Clusterului</primary><secondary>Setarea</secondary></indexterm> Interogarea și Setarea Opțiunilor Clusterului

source: Cluster options can be queried and modified using the <command>crm_attribute</command> tool. To get the current value of <literal>cluster-delay</literal>, simply use:
ro_ro: Opţiunile clusterului pot fi interogate şi modificate folosind utilitarul <command>crm_attribute</command>. Pentru a obţine valoarea curentă a <literal>cluster-delay</literal>, pur şi simplu folosiţi:

source: which is more simply written as
ro_ro: care este scrisă mai simplu ca

source: If a value is found, you'll see a result like this:
ro_ro: Dacă o valoare este găsită, atunci veţi vedea un rezultat ca acesta

source: However, if no value is found, the tool will display an error:
ro_ro: Însă dacă nici o valoare nu este găsită, utilitarul va arăta o eroare:

source: To use a different value, eg. <option>30s</option>, simply run:
ro_ro: Pentru a folosi o altă valoare, ex. <option>30s</option>, pur şi simplu rulaţi:

source: To go back to the cluster's default value you can delete the value, for example with this command:
ro_ro: Pentru a reveni la valoarea implicită a clusterului puteţi ştergeţi valoarea, de exemplu cu această comandă:

source: When Options are Listed More Than Once
ro_ro: Când Opţiunile sunt Listate Mai Mult De O Dată

source: If you ever see something like the following, it means that the option you're modifying is present more than once.
ro_ro: Dacă vedeţi vreodată ceva precum următoarele, înseamnă că opţiunea pe care o modificaţi este prezentă mai mult de o dată.

source: Deleting an option that is listed twice
ro_ro: Ştergerea unei opţiuni care este listată de două ori

source: In such cases follow the on-screen instructions to perform the requested action. To determine which value is currently being used by the cluster, please refer to the section on <xref linkend="ch-rules" />.
ro_ro: În astfel de cazuri urmaţi instrucţiunile de pe ecran pentru a efectua acţiunea cerută. Pentru a determina care valoare este folosită în mod curent de către cluster, vă rugăm să faceţi referinţă la secţiunea despre <xref linkend="ch-rules" />.
