Repository: smellman/pacemaker
Catalog: doc/Pacemaker_Explained/*/Ch-Stonith.po
Languages: ro_ro

source: Protecting Your Data - STONITH
ro_ro: Protejarea Datelor Voastre - STONITH

source: Why You Need STONITH
ro_ro: De Ce Aveţi Nevoie De STONITH

source: <ulink url="http://en.wikipedia.org/wiki/STONITH">STONITH</ulink> is an acronym for Shoot-The-Other-Node-In-The-Head; its purpose is to protect your data from being corrupted by rogue nodes or concurrent access.
ro_ro: <ulink url="http://en.wikipedia.org/wiki/STONITH">STONITH</ulink> este un acronim pentru Shoot-The-Other-Node-In-The-Head şi protejează datele voastre de la a fi corupte de către noduri pribege sau de la acces simultan.

source: When a node is unresponsive it might still access your data. The only way to be 100% sure that your data is safe, is to use STONITH, so we can be certain that the node is truly offline, before allowing the data to be accessed from another node.
ro_ro: Doar pentru că un nod nu mai răspunde, acest lucru nu înseamnă că acesta nu mai accesează datele voastre. Singura metodă de a fi 100% siguri că datele voastre sunt în siguranţă, este să folosiţi STONITH pentru a putea fi siguri că nodul este cu adevărat offline, înainte de a permite datelor să fie accesate de pe alt nod.

source: STONITH also has a role to play in the event that a clustered service cannot be stopped. In this case, the cluster uses STONITH to force the whole node offline, thereby making it safe to start the service elsewhere.
ro_ro: STONITH mai are un rol pe care îl joacă în cazul în care un serviciu de pe cluster nu poate fi oprit. În acest caz, clusterul foloseşte STONITH pentru a forţa întregul nod offline, astfel făcând să fie sigurâ pornirea serviciului în altă parte.

source: What STONITH Device Should You Use
ro_ro: Ce Dispozitiv STONITH Ar Trebui Să Folosiţi

source: It is crucial that the STONITH device can allow the cluster to differentiate between a node and a network failure.
ro_ro: Este imperativ ca dispozitivul STONITH să permită clusterului să facă diferenţa între o defecţiune a nodului şi una a reţelei.

source: The biggest mistake people make in choosing a STONITH device is to use a remote power switch (such as many on-board IPMI controllers) that shares power with the node it controls. In such cases, the cluster cannot be sure if the node is really offline, or active and suffering from a network fault.
ro_ro: Cea mai mare greşeală pe care o fac oamenii în alegerea unui dispozitiv STONITH este să folosească un switch de curent cu acces la distanţă (cum ar fi multe controlere IPMI integrate) care partajează curentul cu nodul pe care îl controlează. În astfel de cazuri, clusterul nu poate fi sigur dacă nodul este cu adevărat offline sau inactiv şi suferă din cauza unei probleme de reţea.

source: Likewise, any device that relies on the machine being active (such as SSH-based "devices" used during testing) are inappropriate.
ro_ro: În mod similar, orice dispozitiv care se bazează pe maşină să fie activă (cum ar fi "dispozitivele" bazate pe SSH folosite în timpul testării) sunt nepotrivite.

source: Configuring STONITH
ro_ro: Configurarea STONITH

source: Find the correct driver: <command>stonith_admin --list-installed</command>
ro_ro: Găsiţi driverul corect: <command>stonith_admin --list-installed</command>

source: Since every device is different, the parameters needed to configure it will vary. To find out which parameters the device supports resp. needs, run:
ro_ro: Din moment ce fiecare dispozitiv este diferit, parametrii necesari să îl configureze vor varia. Pentru a afla parametrii asociaţi dispozitivului, rulaţi:

source: The output should be XML formatted text containing additional parameter descriptions. We will endeavour to make the output more friendly in a later version.
ro_ro: Rezultatul de ieşire ar trebui să fie un text formatat XML conţinând descrierile parametrilor adiţionali. Ne vom aventura să facem rezultatul de ieşire mai prietenos într-o versiune ulterioară.

source: Create a file called <filename>stonith.xml</filename> containing a primitive resource with a class of <literal>stonith</literal>, a type of <replaceable>type</replaceable> and a parameter for each of the values returned in step 2.
ro_ro: Creaţi un fişier numit <filename>stonith.xml</filename> conţinând o resursă primitivă cu o clasă de <literal>stonith</literal>, un tip de <replaceable>type</replaceable> şi un parametru pentru fiecare dintre valorile returnate la pasul 2

source: If the device does not know how to fence nodes based on their uname, you may also need to set the special <constant>pcmk_host_map</constant> parameter. See <command>man stonithd</command> for details.
ro_ro: Dacă dispozitivul nu ştie să evacueze noduri pe baza uname-ului acestora, ar putea fi nevoie să setaţi parametrul special <constant>pcmk_host_map</constant>. Vedeţi <command>man stonithd</command> pentru detalii.

source: If the device does not support the <constant>list</constant> command, you may also need to set the special <constant>pcmk_host_list</constant> and/or <constant>pcmk_host_check</constant> parameters. See <command>man stonithd</command> for details.
ro_ro: Dacă dispozitivul nu suportă comanda <command>list</command>, ar putea fi nevoie să setaţi parametrii speciali <constant>pcmk_host_list</constant> şi/sau <constant>pcmk_host_check</constant>. Vedeţi <command>man stonithd</command> pentru detalii.

source: If the device does not expect the victim to be specified with the <constant>port</constant> parameter, you may also need to set the special <constant>pcmk_host_argument</constant> parameter. See <command>man stonithd</command> for details.
ro_ro: Dacă dispozitivul nu se aşteaptă ca victima să fie specificată cu parametrul <constant>port</constant>, ar putea fi nevoie să setaţi parametrul special <constant>pcmk_host_argument</constant>. Vedeţi <command>man stonithd</command> pentru detalii.

source: Upload it into the CIB using cibadmin: <command>cibadmin -C -o resources --xml-file <filename><replaceable>stonith.xml</replaceable></filename></command>
ro_ro: Încărcaţi-l în CIB folosind cibadmin: <command>cibadmin -C -o resources --xml-file <filename><replaceable>stonith.xml</replaceable></filename></command>

source: Once the stonith resource is running, you can test it by executing: <command>stonith_admin --reboot <replaceable>nodename</replaceable></command>. Although you might want to stop the cluster on that machine first.
ro_ro: Odată ce resursa stonith rulează, o puteţi testa executând: <command>stonith_admin --reboot <replaceable>nodename</replaceable></command>. Deşi aţi putea dori să opriţi clusterul pe acea maşină mai întâi.

source: Example
ro_ro: Exemplu

source: Assuming we have an chassis containing four nodes and an IPMI device active on 10.0.0.1, then we would chose the <literal>fence_ipmilan</literal> driver in step 2 and obtain the following list of parameters:
ro_ro: Presupunând că avem un şasiu conţinând patru noduri şi un dispozitiv IPMI activ pe 10.0.0.1, atunci am alege driverul <literal>fence_ipmilan</literal> la pasul 2 şi am obţine următoarea listă de parametri

source: Obtaining a list of STONITH Parameters
ro_ro: Obţinerea unei liste de Parametri STONITH

source: From this list we would create a STONITH resource fragment that might look like this:
ro_ro: Din această listă am putea crea un fragment de resursă STONITH care ar putea arăta aşa:

source: Sample STONITH Resource
ro_ro: Exemplu de Resursă STONITH

source: The monitor interval of two hours is explained by bugs in some IPMI implementations; see <emphasis>Monitoring the fencing devices</emphasis><footnote><para><ulink url="http://www.clusterlabs.org/doc/crm_fencing.html" /></para></footnote>.
ro_ro: Intervalul de monitorizare de două ore este explicat de bug-uri în anumite implementări de IPMI; vedeți <emphasis>Monitorizarea dispozitivelor de evacuare forțată</emphasis><footnote><para><ulink url="http://www.clusterlabs.org/doc/crm_fencing.html" /></para></footnote>.
