Repository: smellman/pacemaker
Catalog: doc/Clusters_from_Scratch/*/Ch-Installation.po
Languages: ro_ro

source: Installation
ro_ro: Instalare

source: OS Installation
ro_ro: Instalarea Sistemului de Operare

source: Detailed instructions for installing Fedora are available at <ulink url="http://docs.fedoraproject.org/install-guide/f14/">http://docs.fedoraproject.org/install-guide/f&DISTRO_VERSION;/</ulink> in a number of languages. The abbreviated version is as follows...
ro_ro: Instrucțiuni detaliate pentru instalarea Fedora sunt disponibile la <ulink url="http://docs.fedoraproject.org/install-guide/f14/">http://docs.fedoraproject.org/install-guide/f&DISTRO_VERSION;/</ulink> într-un număr de limbi. Versiunea abreviată este după cum urmează ...

source: Point your browser to <ulink url="http://fedoraproject.org/en/get-fedora-all">http://fedoraproject.org/en/get-fedora-all</ulink>, locate the <emphasis>Install Media</emphasis> section and download the install DVD that matches your hardware.
ro_ro: Îndreptați browserul vostru către <ulink url="http://fedoraproject.org/en/get-fedora-all">http://fedoraproject.org/en/get-fedora-all</ulink>, localizați secțiunea <emphasis>Install Media</emphasis> și descărcați DVD-ul de instalare care se potrivește cu hardware-ul vostru.

source: Burn the disk image to a DVD <footnote> <para> <ulink url="http://docs.fedoraproject.org/readme-burning-isos/en-US.html"> http://docs.fedoraproject.org/readme-burning-isos/en-US.html </ulink> </para> </footnote> and boot from it. Or use the image to boot a virtual machine as I have done here. After clicking through the welcome screen, select your language and keyboard layout <footnote> <para> <ulink url="http://docs.fedoraproject.org/install-guide/f13/en-US/html/s1-langselection-x86.html"> http://docs.fedoraproject.org/install-guide/f&DISTRO_VERSION;/en-US/html/s1-langselection-x86.html </ulink> </para> </footnote>
ro_ro: Scrieți imaginea pe un DVD <footnote> <para> <ulink url="http://docs.fedoraproject.org/readme-burning-isos/en-US.html"> http://docs.fedoraproject.org/readme-burning-isos/en-US.html </ulink> </para> </footnote> și bootați de pe acesta. Sau folosiți imaginea pentru a boota o mașină virtuală așa cum am făcut aici. După ce ați selectat prin ecranul de început, selectați limba voastră și așezarea tastaturii <footnote> <para> <ulink url="http://docs.fedoraproject.org/install-guide/f13/en-US/html/s1-langselection-x86.html"> http://docs.fedoraproject.org/install-guide/f&DISTRO_VERSION;/en-US/html/s1-langselection-x86.html </ulink> </para> </footnote>

source: Fedora Installation - Welcome
ro_ro: Instalarea Fedora - Bine ați venit

source: Fedora Installation: Good choice
ro_ro: Instalarea Fedora: O alegere bună

source: Fedora Installation - Storage Devices
ro_ro: Instalarea Fedora - Dispozitive de Stocare

source: Fedora Installation: Storage Devices
ro_ro: Instalarea Fedora: Dispozitive de Stocare

source: Assign your machine a host name. <footnote> <para> <ulink url="http://docs.fedoraproject.org/install-guide/f13/en-US/html/sn-networkconfig-fedora.html"> http://docs.fedoraproject.org/install-guide/f&DISTRO_VERSION;/en-US/html/sn-networkconfig-fedora.html </ulink> </para> </footnote> I happen to control the clusterlabs.org domain name, so I will use that here.
ro_ro: Asignați mașinii un nume de gazdă. <footnote> <para> <ulink url="http://docs.fedoraproject.org/install-guide/f13/en-US/html/sn-networkconfig-fedora.html"> http://docs.fedoraproject.org/install-guide/f&DISTRO_VERSION;/en-US/html/sn-networkconfig-fedora.html </ulink> </para> </footnote> Eu se întâmplă să controlez numele de domeniu clusterlabs.org, așa că îl voi folosi pe acesta aici.

source: Fedora Installation - Hostname
ro_ro: Instalarea Fedora - Nume de gazdă

source: Fedora Installation: Choose a hostname
ro_ro: Instalarea Fedora: Alegeți un nume pentru gazdă

source: You will then be prompted to indicate the machine’s physical location and to supply a root password. <footnote> <para> <ulink url="http://docs.fedoraproject.org/install-guide/f13/en-US/html/sn-account_configuration.html"> http://docs.fedoraproject.org/install-guide/f&DISTRO_VERSION;/en-US/html/sn-account_configuration.html </ulink> </para> </footnote>
ro_ro: Vi se va cere ulterior să indicați locația fizică a mașinii și să furnizați o parolă de root. <footnote> <para> <ulink url="http://docs.fedoraproject.org/install-guide/f13/en-US/html/sn-account_configuration.html"> http://docs.fedoraproject.org/install-guide/f&DISTRO_VERSION;/en-US/html/sn-account_configuration.html </ulink> </para> </footnote>

source: Now select where you want Fedora installed. <footnote> <para> <ulink url="http://docs.fedoraproject.org/install-guide/f13/en-US/html/s1-diskpartsetup-x86.html">http://docs.fedoraproject.org/install-guide/f13/en-US/html/s1-diskpartsetup-x86.html</ulink> </para> </footnote> As I don’t care about any existing data, I will accept the default and allow Fedora to use the complete drive. However I want to reserve some space for DRBD, so I'll check the <literal>Review and modify partitioning layout</literal> box.
ro_ro: Acum selectați unde vreți Fedora să fie instalată. <footnote> <para> <ulink url="http://docs.fedoraproject.org/install-guide/f13/en-US/html/s1-diskpartsetup-x86.html">http://docs.fedoraproject.org/install-guide/f13/en-US/html/s1-diskpartsetup-x86.html</ulink> </para> </footnote> Deoarece nu îmi pasă de orice date existente, voi accepta valorile implicite și voi permite Fedorei să folosească întregul disc. Totuși vreau să rezerv ceva spațiu pentru DRBD, așa că voi bifa caseta <literal>Review and modify partitioning layout</literal>.

source: Fedora Installation - Installation Type
ro_ro: Instalarea Fedora - Tipul de Instalare

source: Fedora Installation: Choose an installation type
ro_ro: Instalarea Fedora: Alegeți tipul de instalare

source: By default, Fedora will give all the space to the <literal>/</literal> (aka. root) partition. Wel'll take some back so we can use DRBD.
ro_ro: În mod implicit, Fedora va da tot spațiul către partiția <literal>/</literal> (root). Vom lua ceva din acesta înapoi pentru a putea folosi DRBD.

source: Fedora Installation - Default Partitioning
ro_ro: Instalarea Fedora - Partiționarea Implicită

source: The finalized partition layout should look something like the diagram below.
ro_ro: Așezarea finalizată a partițiilor ar trebui să arate asemănător cu diagrama de mai jos.

source: If you plan on following the DRBD or GFS2 portions of this guide, you should reserve at least 1Gb of space on each machine from which to create a shared volume.
ro_ro: Dacă plănuiți să urmați porțiunile referitoare la DRBD sau GFS2 ale acestui ghid, ar trebui să rezervați cel puțin 1Gb de spațiu pe fieare mașină din care să creați un volum partajat.

source: Fedora Installation - Customize Partitioning
ro_ro: Instalarea Fedora - Customizarea Partiționării

source: Fedora Installation: Create a partition to use (later) for website data
ro_ro: Instalarea Fedora: Creați o partiție pentru a o folosi (mai târziu) pentru datele website-ului

source: Fedora Installation - Bootloader
ro_ro: Instalarea Fedora - Bootloader

source: Fedora Installation: Unless you have a strong reason not to, accept the default bootloader location
ro_ro: Instalarea Fedora: Decât dacă aveți un motiv puternic împotriva acestui lucru, acceptați locația implicită pentru bootloader

source: Next choose which software should be installed. Change the selection to <literal>Web Server</literal> since we plan on using Apache. Don't enable updates yet, we'll do that (and install any extra software we need) later. After you click next, Fedora will begin installing.
ro_ro: În continuare alegeți ce software ar trebui să fie instalat. Schimbați selecția pe <literal>Web Server</literal> din moment ce plănuim să instalăm Apache. Nu activați încă actualizările, o să facem asta (și vom instala orice software adițional de care avem nevoie) mai târziu. După ce faceți click pe Next, Fedora va începe să se instaleze.

source: Fedora Installation - Software
ro_ro: Instalarea Fedora - Software

source: Fedora Installation: Software selection
ro_ro: Instalarea Fedora: Selecția software-ului

source: Fedora Installation - Installing
ro_ro: Instalarea Fedora - Instalează

source: Fedora Installation: Go grab something to drink, this may take a while
ro_ro: Instalarea Fedora: Mergeți să vă luați ceva de băut, asta ar putea dura o vreme

source: Fedora Installation - Installation Complete
ro_ro: Instalarea Fedora - Instalarea a Terminat

source: Fedora Installation: Stage 1, completed
ro_ro: Instalarea Fedora: Stadiul 1, terminat

source: Once the node reboots, follow the on screen instructions <footnote> <para> <ulink url="http://docs.fedoraproject.org/install-guide/f13/en-US/html/ch-firstboot.html"> http://docs.fedoraproject.org/install-guide/f&DISTRO_VERSION;/en-US/html/ch-firstboot.html </ulink> </para> </footnote> to create a system user and configure the time.
ro_ro: Odată ce nodul repornește, urmați instrucțiunile de pe ecran <footnote> <para> <ulink url="http://docs.fedoraproject.org/install-guide/f13/en-US/html/ch-firstboot.html"> http://docs.fedoraproject.org/install-guide/f&DISTRO_VERSION;/en-US/html/ch-firstboot.html </ulink> </para> </footnote> pentru a crea un utilizator de system și pentru a configura ora.

source: Fedora Installation - First Boot
ro_ro: Instalarea Fedora - Primul Boot

source: Fedora Installation - Create Non-privileged User
ro_ro: Instalarea Fedora - Creați un Utilizator Neprivilegiat

source: Fedora Installation: Creating a non-privileged user, take note of the password, you'll need it soon
ro_ro: Instalarea Fedora: Creând un utilizator neprivilegiat, rețineți parola, o să aveți nevoie de ea în curând

source: It is highly recommended to enable NTP on your cluster nodes. Doing so ensures all nodes agree on the current time and makes reading log files significantly easier.
ro_ro: Este foarte recomandat să activați NTP-ul pe nodurile din cluster. Realizând acest lucru asigură câ toate nodurile sunt de acord asupra datei curente și acest lucru face citirea fișierelor de log semnificativ mai ușoară.

source: Fedora Installation - Date and Time
ro_ro: Instalarea Fedora - Data și Ora

source: Fedora Installation: Enable NTP to keep the times on all your nodes consistent
ro_ro: Instalarea Fedora: Activați NTP pentru a menține data consistentă pe noate nodurile

source: Click through the next screens until you reach the login window. Click on the user you created and supply the password you indicated earlier.
ro_ro: Selectați cu mouse-ul prin următorul ecran până ajungeți la fereastra de login. Selectați utilizatorul pe care l-ați creat și furnizați parola pe care ați ales-o mai devreme.

source: Fedora Installation - Customize Networking
ro_ro: Instalarea Fedora - Personalizați Rețeaua

source: Fedora Installation: Click here to configure networking
ro_ro: Instalarea Fedora: Selectați aici pentru a configura rețeaua

source: Do not accept the default network settings. Cluster machines should <emphasis>never</emphasis> obtain an ip address via DHCP. Here I will use the <emphasis>internal</emphasis> addresses for the clusterlab.org network.
ro_ro: Nu acceptați setările implicite de rețea. Mașinile din cluster nu ar trebui <emphasis>niciodată</emphasis> să obțină o adresă IP via DHCP. Aici voi folosi adresele <emphasis>interne</emphasis> pentru rețeaua clusterlab.org.

source: Fedora Installation - Specify Network Preferences
ro_ro: Instalarea Fedora - Specificați Preferințele de Rețea

source: Fedora Installation: Specify network settings for your machine, never choose DHCP
ro_ro: Instalarea Fedora: Specificați setările de rețea pentru mașina voastră, să nu alegeți niciodată DHCP

source: Fedora Installation - Activate Networking
ro_ro: Instalarea Fedora - Activați Rețeaua

source: Fedora Installation: Click the big green button to activate your changes
ro_ro: Instalarea Fedora: Selectați butonul mare verde pentru a activa modificările voastre

source: Fedora Installation - Bring up the Terminal
ro_ro: Instalarea Fedora - Porniți Terminalul

source: Fedora Installation: Down to business, fire up the command line
ro_ro: Instalarea Fedora: Să trecem la afaceri, porniți linia de comandă

source: That was the last screenshot, from here on in we’re going to be working from the terminal.
ro_ro: Aceea a fost ultima captură de ecran, de aici înainte vom lucra de la terminal.

source: Cluster Software Installation
ro_ro: Instalarea Software-ului de Cluster

source: Go to the terminal window you just opened and switch to the super user (aka. "root") account with the <command>su</command> command. You will need to supply the password you entered earlier during the installation process.
ro_ro: Mergeți la fereastra de terminal pe care tocmai ați deschis-o și schimbați la contul de super utilizator (adică la "root") cu comanda <command>su</command>. Va trebui să furnizați parola pe care ați introdus-o mai devreme în timpul procesului de instalare.

source: Note that the username (the text before the @ symbol) now indicates we’re running as the super user “root”.
ro_ro: Luați aminte că numele de utilizator (textul dinaintea simbolului @) acum indică faptul că rulăm ca super utilizatorul "root".

source: Security Shortcuts
ro_ro: Scurtături de Securitate

source: To simplify this guide and focus on the aspects directly connected to clustering, we will now disable the machine’s firewall and SELinux installation. Both of these actions create significant security issues and should not be performed on machines that will be exposed to the outside world.
ro_ro: Pentru a simplifica acest ghid și pentru a ne concentra pe aspecte care sunt legate în mod direct de clustering, o să dezactivăm acum firewall-ul mașinii și instalarea de SELinux. Ambele aceste acțiuni creează probleme semnificative de securitate și nu ar trebui să fie efectuate pe mașini care vor fi expuse în mod direct către lumea exterioara.

source: TODO: Create an Appendix that deals with (at least) re-enabling the firewall.
ro_ro: TODO: Crearea unui Apendix care să se ocupe cu (cel puțin) reactivarea firewall-ului.

source: You will need to reboot for the SELinux changes to take effect. Otherwise you will see something like this when you start corosync:
ro_ro: Va trebui să reporniți pentru ca modificările de SELinux să ia effect. Altfel ați vedea ceva similar cu acesta când veți porni corosync:

source: Install the Cluster Software
ro_ro: Instalați Software-ul de Cluster

source: Since version 12, Fedora comes with recent versions of everything you need, so simply fire up the shell and run:
ro_ro: Începând cu versiunea 12, Fedora vine cu versiuni recente ale tuturor lucrurilor de care aveți nevoie, așa că pur și simplu porniți shell-ul și rulați:

source: Before You Continue
ro_ro: Înainte de a Continua

source: Repeat the Installation steps so that you have 2 Fedora nodes with the cluster software installed.
ro_ro: Repetați pașii de Instalare astfel încât să aveți 2 noduri cu Fedora cu software-ul de cluster instalat.

source: For the purposes of this document, the additional node is called pcmk-2 with address 192.168.122.42.
ro_ro: Pentru scopurile acestui document, nodul adițional este numit pcmk-2 cu adresa 192.168.122.42.

source: Finalize Networking
ro_ro: Finalizați Rețelistica

source: Confirm that you can communicate with the two new nodes:
ro_ro: Confirmați că puteți comunica cu cele două noi noduri:

source: Verify Connectivity by IP address
ro_ro: Verificați Conectivitatea după Adresa IP

source: Now we need to make sure we can communicate with the machines by their name. If you have a DNS server, add additional entries for the two machines. Otherwise, you’ll need to add the machines to /etc/hosts . Below are the entries for my cluster nodes:
ro_ro: Acum trebuie să ne asigurăm că putem comunica cu mașinile după numele acestora. Dacă aveți un server DNS, adăugați intrări adiționale pentru cele două mașini. În caz contrar, va trebui să adăugați mașinile în /etc/hosts. Mai jos sunt intrările pentru nodurile mele de cluster:

source: Set up /etc/hosts entries
ro_ro: Setați intrările din /etc/hosts

source: We can now verify the setup by again using ping:
ro_ro: Putem verifica setup-ul folosind ping din nou:

source: Verify Connectivity by Hostname
ro_ro: Verificați Conectivitatea după Numele Gazdei

source: Configure SSH
ro_ro: Configurați SSH

source: SSH is a convenient and secure way to copy files and perform commands remotely. For the purposes of this guide, we will create a key without a password (using the -N “” option) so that we can perform remote actions without being prompted.
ro_ro: SSH este un mod convenabil și sigur de a copia fișierele și de a efectua comenzi pe sisteme la distanță. Pentru scopurile acestui ghid, vom crea o cheie fără parolă (folosind opțiunea -N "") astfel încât să putem efectua acțiuni la distanță fără a mai fi întrebați.

source: Unprotected SSH keys, those without a password, are not recommended for servers exposed to the outside world.
ro_ro: Chei neprotejate de SSH, precum cele fără parolă, nu sunt recomandate pentru servere expuse la lumea externă.

source: Create a new key and allow anyone with that key to log in:
ro_ro: Creați o cheie nouă și permiteți oricui cu acea cheie să se logheze:

source: Creating and Activating a new SSH Key
ro_ro: Crearea și Activarea unei Chei noi SSH

source: Install the key on the other nodes and test that you can now run commands remotely, without being prompted
ro_ro: Instalați cheia pe celelalte noduri și testați că acum puteți rula comenzi de la distanță, fără să mai fiți întrebați

source: Installing the SSH Key on Another Host
ro_ro: Instalarea Cheii SSH pe o Altă Gazdă

source: Short Node Names
ro_ro: Numele Scurte ale Nodurilor

source: During installation, we filled in the machine’s fully qualifier domain name (FQDN) which can be rather long when it appears in cluster logs and status output. See for yourself how the machine identifies itself:
ro_ro: În timpul instalării, am completat numele complet calificat de domeniu (FQDN) al mașinii care poate fi destul de lung când apare în logurile clusterului sau în rezultatul de ieșire al status-ului. Vedeți pentru voi înșivă cum se identifică singură mașina:

source: The output from the second command is fine, but we really don’t need the domain name included in the basic host details. To address this, we need to update /etc/sysconfig/network. This is what it should look like before we start.
ro_ro: Rezultatul de ieșire de la a doua comandă este în regulă, dar nu avem nevoie cu adevărat ca numele de domeniu să fie inclus în detaliile de bază ale gazdei. Pentru a adresa acest lucru, trebuie să actualizăm /etc/sysconfig/network. Așa ar trebui să arate înainte să începem.

source: All we need to do now is strip off the domain name portion, which is stored elsewhere anyway.
ro_ro: Tot ceea ce trebuie să facem acum este să scoatem porțiunea de nume de domeniu, care este stocată oricum în altă parte.

source: Now confirm the change was successful. The revised file contents should look something like this.
ro_ro: Acum confirmați că modificarea a fost realizată cu succes. Conținutul fișierului revizuit ar trebui să arate ceva de genul acesta.

source: However we’re not finished. The machine won't normally see the shortened host name until about it reboots, but we can force it to update.
ro_ro: Însă nu am terminat. Mașina nu ar vedea în mod normal lista de nume de gazde scurtate până ce nu repornește, dar putem să o forțăm să se actualizeze.

source: Now check the machine is using the correct names
ro_ro: Acum verificați că mașina folosește numele corecte

source: Now repeat on pcmk-2.
ro_ro: Acum repetați pe pcmk-2.

source: Configuring Corosync
ro_ro: Configurarea Corosync

source: Choose a port number and multicast <footnote> <para> <ulink url="http://en.wikipedia.org/wiki/Multicast">http://en.wikipedia.org/wiki/Multicast</ulink> </para> </footnote> address. <footnote> <para> <ulink url="http://en.wikipedia.org/wiki/Multicast_address">http://en.wikipedia.org/wiki/Multicast_address</ulink> </para> </footnote>
ro_ro: Alegeți un număr de port și o <footnote> <para> <ulink url="http://en.wikipedia.org/wiki/Multicast">http://en.wikipedia.org/wiki/Multicast</ulink> </para> </footnote> adresă multicast. <footnote> <para> <ulink url="http://en.wikipedia.org/wiki/Multicast_address">http://en.wikipedia.org/wiki/Multicast_address</ulink> </para> </footnote>

source: Be sure that the values you chose do not conflict with any existing clusters you might have. For advice on choosing a multicast address, see <ulink url="http://www.29west.com/docs/THPM/multicast-address-assignment.html"> http://www.29west.com/docs/THPM/multicast-address-assignment.html </ulink>
ro_ro: Asigurați-vă că valorile pe care le alegeți nu dau conflicte cu alte clustere existente pe care le-ați putea avea. Pentru sfaturi în privința alegerii unei adrese multicast, vedeți <ulink url="http://www.29west.com/docs/THPM/multicast-address-assignment.html"> http://www.29west.com/docs/THPM/multicast-address-assignment.html </ulink>

source: For this document, I have chosen port 4000 and used 226.94.1.1 as the multicast address.
ro_ro: Pentru acest document, am ales portul 4000 și am folosit 226.94.1.1 ca adresă multicast

source: The instructions below only apply for a machine with a single NIC. If you have a more complicated setup, you should edit the configuration manually.
ro_ro: Instrucțiunile de mai jos se aplică numai pentru o mașină cu o singură placă de rețea. Dacă aveți un setup mai complicat, ar trebui să editați configurația manual.

source: Next we automatically determine the hosts address. By not using the full address, we make the configuration suitable to be copied to other nodes.
ro_ro: În continuare determinăm în mod automat adresa gazdelor. Nefolosind adresa completă, facem configurația fezabilă pentru a fi copiată pe alte noduri.

source: Display and verify the configuration options
ro_ro: Listați și verificați opțiunile de configurare

source: Once you're happy with the chosen values, update the Corosync configuration
ro_ro: Odată ce sunteți mulțumiți cu valorile alese, actualizați configurația Corosync

source: Finally, tell Corosync to load the Pacemaker plugin.
ro_ro: În sfârșit, spuneți Corosync-ului să încarce plugin-ul de Pacemaker.

source: The final configuration should look something like the sample in <xref linkend="ap-corosync-conf" />.
ro_ro: Configurația finală ar trebui să arate ceva similar cu exemplul din <xref linkend="ap-corosync-conf"/>.

source: When run in version 1 mode, the plugin does not start the Pacemaker daemons. Instead it just sets up the quorum and messaging interfaces needed by the rest of the stack.
ro_ro: Când rulează în modul versiunea 1, plugin-ul nu pornește daemonii Pacemaker-ului. În schimb doar setează quorum-ul și interfețele de mesagerie necesitate de către restul stivei.

source: Starting the dameons occurs when the Pacemaker init script is invoked. This resolves two long standing issues:
ro_ro: Pornirea daemonilor se întâmplă când scriptul de init al Pacemaker este invocat. Acest lucru rezolvă două probleme existente de mult timp:

source: Forking inside a multi-threaded process like Corosync causes all sorts of pain. This has been problematic for Pacemaker as it needs a number of daemons to be spawned.
ro_ro: Forking-ul înăuntrul unui proces multi-threaded precum Corosync cauzează tot felul de probleme. Acest lucru a fost problematic pentru Pacemaker din moment ce acesta are nevoie de un număr de daemoni să fie lansați în execuție.
