Repository: smellman/pacemaker
Catalog: doc/Clusters_from_Scratch/*/Ch-Installation.po
Languages: ro_ro

source: Corosync was never designed for staggered shutdown - something previously needed in order to prevent the cluster from leaving before Pacemaker could stop all active resources.
ro_ro: Corosync nu a fost niciodată conceput pentru închiderea în pași - un aspect necesar anterior pentru a preveni clusterul din a ieși înainte ca Pacemaker să poată opri toate resursele active.

source: Propagate the Configuration
ro_ro: Propagarea Configurației

source: Now we need to copy the changes so far to the other node:
ro_ro: Acum trebuie să copiem modificările făcute până acum pe celălalt nod:
